namespace CatSystem
{

    // какво може да имае една котка(какво представлява)... и започваме да мислим...
    public class Cat
    {
        public Cat(CatColor color)  // ще зададем цвета на котката при самото и разждане разбирасе, 
        {                           // с конструктор, който пък ще дава стоиността на пропъртито
            this.Color = color;
        }
        public string Name { get; set; }    // правим си име на котката

        public int Age { get; private set; }  // правим си и години на котката

        public Owner Owner { get; set; }   // правим си и стопанин на котката, като то може да се set-ва(тоест да си сменя стопанина)
        public CatColor Color { get; private set; }  // правим си цвета на котката, който ще можем да видим, но няма да можем да променяме 
                                                     //понеже котките не си променят цвета просто така, затова е private set:D 
    }
}
