namespace _03.ExtMethodsLambdaExprLinq
{
    using System;
    using System.Collections.Generic;
    using System.Linq;
    using System.Text;
    using System.Threading.Tasks;

    public class AnonymousTypes
    {
        // Нещо което вие не сте декларирали, като клас, но все пак се държи като обект с пропъртита.
        // Идеята им е без да слагате конкретен клас, директно да напишете накакви пропъртита, които искате
        // да сетнете, като стойности. Те са read-only. И се използват, ако ни трябва обект само на 1 място или НЕ на мн места, и не искаме да губим време да създаваме цял клас.
        // Може да ползваме анонимен тип. ТОВА Е ЕДИН ВИД, АВТОМАТИЧЕН КЛАС! НЕДОСТАТЪКА Е, ЧЕ НЯМА КАК ДА ГО ПОДАВАМЕ НА МЕТОДИ И ТН. ПОНЕЖЕ НЯМАМЕ ТИП ДАННИ С КОЙТО ДА РАБОТИМ(ПОНЕЖЕ Е АНОНИМЕН)     
        // Дефинират се така с ключовата дума var името = new (вместо типа който искаме Student или др клас от който ни е обекта(понеже е анонимен няма нищо))
        // директно отваряме скобите {  }  и описвате каквото  ви трябва в тях
        // ето така : var point = new { X = 3, Y = 5 };

            //пример:
        public string  FirstName { get; set; }

        public string LastName { get; set; }


    }
}
