namespace _03.ExtMethodsLambdaExprLinq
{
    using System;
    using System.Collections.Generic;
    using System.Linq;
    using System.Text;
    using System.Threading.Tasks;

    public class LINQAndQueries
    {
        // LINQ- Lenguage Integreated Native Query: Тоест можете да правите заявки, най общо казано.
        // LINQ- са екстеншън методи, които ви позволяват да работите в/у всякакви колекции и да 
        // правите накакви заявки към тях(дай ми всички чила по-големи от 5, дай ми вс стрингове с по-голяма дължина от 3 и тн..)
        // LINQ е унифициран начин да правим заявки към някакви неща, бази данни , обекти , json, xml и тн..
        // Има 2 начина за писане на LINQ с 1-Ключови думички(from, where, select, group, orderby)
        // И 2- С екстеншън методи-where, order by и тн..

        // 1-ви вариант- from(откъде да вземем данните), where(дава възможност да правим заявка и да казваме дай ми всички по-големи от 5,
        // дай ми вс по-малки от 10 и тн.....намери ми вс които имат едиси какво...), select(позволява да селектираме само част от данните, например
        // ако имаме студен, да ни извади само пъров и второ име и тн..), group(позволява да групираме по дадено поленце, групирай вс по оценки примерно),
        // orderby(позволява да сортираме по нещо, сортирай по едиси какво и тн...)
    }
}
