namespace ExtensionMethods
{
    using System;
    using System.Collections.Generic;
    using System.Linq;
    using System.Text;
    using System.Threading.Tasks;
    public static class ExtensionMethods
    {
        // Когато вкараме в проект някаква външна библиотека, вкарате нещо директно от дотнет,
        // нещо до което нямате достъп(кефи ни, но ни трябва още някаква функционалност, към вече готовата),
        // вие с така наречените екстеншън методи може да добавите, 
        // допълнителни методи, допълнителна функционалност към вече компилирани типове, тоест вече
        // компирлирани класове!!! Без да ги рекомпилирате и без да пипате въобще оригиналното асембли.
        // Един елементарен пример: Искате в стринга да добавите функционалност, която да ви брой, колко
        // са на брой думите, нещо такова, тоест функционалност, която да сплитне по интервали и след това
        // да преброи колко са парченцата...нещо такова, вие можете да си направите метод който да го прави 
        // и е ок, но може да НАПРАВИТЕ И ЕКСТЕНШЪН МЕТОД И ИДЕЯТА МУ Е, ЧЕ КАТО НАПРАВИТЕ ЕКСТЕНШЪН МЕТОД
        // ТВА НЕШО ВЕЧЕ ЩЕ ЗАПОЧНЕ ДА РАБОТИ ГЛОБАЛНО В/У ВСИЧКИ СТРИНГОВЕ!!!

        // ЕКСТ. МЕТОДИТЕ МОГАТ ДА СЪЩЕСТЪВАТ САМО В СТАТИЧНИ КЛАСОВЕ(ТОВА Е ЗАДЪЛЖИТЕЛНО)!
        // всичко в статичният клас също ще бъде статично

        public static int CountWords(this string input)  // метода трябва да се статичен, след това слагаме ключовата дума this(която оказва какво да екстендваме) , след това типа данни който искаме да екстендваме(стринг в случая)
        {                                             // и как се казва променливата името и е без значение(инпут в случая)
            var words = input.Split(' '); // тук ни е логиката която искаме да имплементираме(може да бъде всичко което си искаме)
            return words.Length;
        }

        // По този начин, казваме на c#-a, имам статичен клас, статичен метод в него и той казва this string и от тук на татък c# ще се сети (аха добре значи искаш вс стрингове
        // да може да им се извиква CountWords и самият стринг ще бъде подаден горе на input , като параметър).Тоест можем да кажем вече в мейн-а text.CountWords(); и това вече работи
        // Добра практика е: Екстеншъните да бъдат вотделна папка затова си ги слагаме  в отделна...
    }
}
