namespace DocumentSystem
{
    using System;
    using System.Collections.Generic;
    using System.Linq;
    using System.Text;
    using System.Threading.Tasks;

    public interface IDocument  // това е интерфейса, ВСИЧКО КОЕТО СЕ ДЕФИНИРА В ИНТЕРФЕЙСА СЕ ПРИЕМА ЗА ПУБЛИЧНО!!!
    {
        // Просто казваме всичко, което е IDocument, има тези 3 неща, нямаме сетъри и спокойно, можем спосле само гетътри да си оставим или сетърите да си направим private
        string Name { get; }  // идокумент интерфейса, ще имплементира пропърти Name, всъщност даден клас, който наследява IDocument ще трябва да го имплементира, да му каже тва се прави така и така.. 
        string Content { get; } // идокумент интерфейса, ще имплементира Content, всъщност даден клас, който наследява IDocument ще трябва да го имплементира, да му каже тва се прави така и така..
        string ToString();  // ще имплементира и ToString() метод, всъщност даден клас, който наследява IDocument ще трябва да го имплементира, да му каже тва се прави така и така..
    }
}
